Repository: KamilSztandur/flappy_dash
Catalog: lib/resources/translations/l10n/app_*.arb
Languages: pl

# common_switch_language
source: Przełącz na polski
pl: Switch to English

# game_flutter_tips_1
source: Don’t use null-safety, everything used to work fine without it anyway.
pl: Nie używaj null-safety, kiedyś wszystko działało bez tego

# game_flutter_tips_2
source: Don’t split code into files – one giant file is the true power of a senior developer.
pl: Nie dziel kodu na pliki – jeden duży plik to prawdziwa siła seniora

# game_flutter_tips_3
source: Don’t use const, it makes the code look way too serious.
pl: Nie używaj const, bo wtedy kod wygląda zbyt poważnie

# game_flutter_tips_4
source: Always set “shrinkWrap: true” because it’s super convenient.
pl: Zawsze ustawiaj “shrinkWrap: true”, bo to super wygodne

# game_flutter_tips_5
source: Add a comment to every single line so it looks like you worked really hard.
pl: Dodawaj komentarz do każdego wiersza kodu, żeby wyglądało, że się naprawdę narobiłeś

# game_flutter_tips_6
source: If something isn’t in Material, it simply can’t be done in Flutter.
pl: Jeśli czegoś nie ma w Materialu, to znaczy, że nie da się tego we Flutterze zrobić

# game_flutter_tips_7
source: Write everything in one massive widget tree so you never have to pass anything through constructors.
pl: Pisz wszystko w jednym drzewie widgetów, to nie będziesz musiał przekazywać rzeczy przez konstruktory

# game_flutter_tips_8
source: Linter is a waste of time. It compiles, so what’s the problem?
pl: Linter to strata czasu. Przecież się kompiluje, więc co za różnica?

# game_flutter_tips_9
source: Code formatting is unnecessary and kills a developer’s unique artistic style.
pl: Formatowanie kodu jest zbędne i zabija indywidualny styl programisty

# game_flutter_tips_10
source: If all your Providers are global, you’ll never hit a “ProviderNotFound” exception.
pl: Jeżeli wszystkie Twoje Providery będą globalne, to nigdy nie natrafisz na wyjątek „ProviderNotFound”

# game_flutter_tips_11
source: Test failing? Set “skip” to true and it magically stops failing.
pl: Nie działa Ci test? Daj flagę “skip” na true, a przestanie się sypać

# game_flutter_tips_12
source: Slivers are easy. Just mix “SliverToBoxAdapter” with “SingleChildScrollView” and “Column” for an amazing layout.
pl: Slivery są proste. “SliverToBoxAdapter” z “SingleChildScrollView” z “Column” i masz super layout

# game_flutter_tips_13
source: Why even bother with Flutter? Kotlin is more comfortable anyway.
pl: Po co w ogóle ten Flutter, Kotlin wygodniejszy

# game_flutter_tips_14
source: Warnings are just friendly suggestions; you don’t need to listen to them.
pl: Warningi to tylko sugestie, nie musisz ich przestrzegać

# game_flutter_tips_15
source: Always use print() instead of the debugger.
pl: Zawsze rób print() zamiast debuggera

# game_flutter_tips_17
source: Never refactor – it kills your flow!
pl: Nie rób refaktoryzacji – to zabija flow!

# game_flutter_tips_18
source: Never update packages – everything worked perfectly in 2021.
pl: Nigdy nie aktualizuj paczek – przecież działało w 2021

# game_flutter_tips_19
source: Always use StatefulWidget; maybe someday you’ll actually use its state.
pl: Używaj zawsze StatefulWidget, może kiedyś użyjesz jego stanu

# game_flutter_tips_20
source: There’s nothing more I can teach you — you’re already a perfect senior.
pl: Niczego więcej Cię już nie nauczę, jesteś perfekcyjnym seniorem

# game_flutter_tips_progress_more
source: Progress more to see more!
pl: Graj dalej, żeby zobaczyć więcej!

# game_flutter_tips_tip_out_of
source: Flutter Tip #{count} (out of {total})
pl: Flutter Tip #{count} (z {total})

# game_over_message
source: {count, plural, =1 {Your score was {count} point} other {Your score was {count} points}}
pl: {count, plural, =1 {Twój wynik to {count} punkt} few {Twój wynik to {count} punkty} many {Twój wynik to {count} punktów} other {Twój wynik to {count} punktów}}

# game_over_title
source: GAME OVER {username}!
pl: TO KONIEC {username}!

# home_cancel
source: Cancel
pl: Anuluj

# home_enter_username
source: Enter username
pl: Wpisz Twoją nazwę

# home_save
source: Save
pl: Zapisz

# home_username
source: Username
pl: Twoja nazwa

# leaderboard_empty_subtitle
source: Play a game to get started
pl: Zagraj, aby to zmienić

# leaderboard_empty_title
source: No scores yet!
pl: Pusto tutaj!

# leaderboard_title
source: Leaderboard
pl: Tablica wyników

# main_menu_press_anywhere_to_start
source: TAP ANYWHERE TO RELEASE THE BIRD
pl: STUKNIJ GDZIEKOLWIEK, ABY UWOLNIĆ PTAKA

# phone_emulator_wrapper_switch_to_fullscreen
source: Switch to desktop mode
pl: Powróć do trybu desktopowego

# phone_emulator_wrapper_switch_to_phone
source: Switch to Phone Emulator Mode
pl: Przełącz w tryb emulacji telefonu

# settings_scoreboard
source: Scoreboard
pl: Tablica wyników

# settings_settings
source: Settings
pl: Ustawienia
